In [1]:
import pandas as pd

# Load data into a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Marie'],
    'Age': [25, 30, 35, 40, 20],
    'City': ['New York', 'Los Angeles', 'San Francisco', 'Chicago', 'Washington']
}

df = pd.DataFrame(data)
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30    Los Angeles
2  Charlie   35  San Francisco
3    David   40        Chicago
4    Marie   20     Washington

In [9]:
new_row = {'name': 'Johndddddd', 'age': 35, 'city': 'New York'}
df.loc[len(df)] = new_row

In [10]:
df

       Name   Age           City
0     Alice  25.0       New York
1       Bob  30.0    Los Angeles
2   Charlie  35.0  San Francisco
3     David  40.0        Chicago
4     Marie  20.0     Washington
5       NaN   NaN            NaN
9       NaN   NaN            NaN
10      NaN   NaN            NaN
8       NaN   NaN            NaN